const handler = async (m, {conn}) => {
  m.reply(global.apos);
};
handler.command = /^(Apos|Apostado)$/i;
export default handler;

global.apos = `
👺 𝗥𝗲𝗴𝗹𝗮𝘀 𝗔𝗽𝗼𝘀 𝗛𝗮𝗰𝗸 👺

➤𝟭𝗿𝗮 𝗦𝗮𝗹𝗮 : 𝗥𝗶𝘃𝗮𝗹
➤𝟮𝗱𝗮 𝗦𝗮𝗹𝗮 : 
➤𝟯𝗿𝗮 𝗦𝗮𝗹𝗮 : 𝗣𝗲𝗿𝗱𝗲𝗱𝗼𝗿 𝗗𝗲 𝟭𝗿𝗮

👺 𝗖𝗼𝗻𝗳𝗶𝗴 𝗦𝗮𝗹𝗮 / 𝗔𝘃𝗮𝗻𝘇𝗮𝗱𝗮 👺

➤𝗠𝗼𝗻𝗲𝗱𝗮 : 𝟵𝟵𝟱𝟬
➤𝗔𝗱𝗶𝘁𝗮𝗺𝗲𝗻𝘁𝗼𝘀 𝗬 𝗔𝘁𝗿𝗶𝗯𝘂𝘁𝗼𝘀 : 𝗡𝗼
➤𝗔𝗶𝗱𝗿𝗼𝗽 𝗫𝟮 : 𝗡𝗼
➤𝗠𝘂𝗻𝗶𝗰𝗶𝗼𝗻𝗲𝘀 : 𝗦𝗶
➤𝗘𝗺𝘂𝗹𝗮𝗱𝗼𝗿 : 𝗔 𝗖𝗼𝗼𝗿𝗱𝗶𝗻𝗮𝗿
➤𝗥𝗼𝗻𝗱𝗮𝘀 : 𝟭𝟯

👺 𝗔𝗰𝗹𝗮𝗿𝗮𝗰𝗶𝗼𝗻𝗲𝘀 👺

➤𝟭𝗿𝗮 𝗥𝗼𝗻𝗱𝗮 𝗦𝗼𝗹𝗼 𝗗𝗲𝘀𝗲𝗿𝘁 ( 𝗤𝘂𝗲𝗱𝗮 𝗣𝗿𝗼𝗵𝗶𝗯𝗶𝗱𝗼 𝗗𝗲𝘀𝗽𝘂𝗲𝘀 )
➤𝗔𝗿𝗺𝗮𝘀 𝗦𝗼𝗹𝗼 𝗨𝗺𝗽 , 𝗠𝗽𝟰𝟬 , 𝗠𝟭𝟬𝟭𝟰
➤𝗛𝗮𝗯𝗶𝗹𝗶𝗱𝗮𝗱 𝗔𝗰𝘁𝗶𝘃𝗮 𝗬 𝗣𝗮𝘀𝗶𝘃𝗮 : 𝗔𝗹𝗼𝗸 , 𝗞𝗲𝗹𝗹𝘆 , 𝗠𝗮𝘅𝗶𝗻 , 𝗠𝗼𝗰𝗼
➤𝗔𝗹𝘁𝘂𝗿𝗮 𝗩𝗮𝗹𝗶𝗱𝗮𝘀 𝗦𝗼𝗹𝗼 : 𝗣𝗮𝗿𝗲𝗱𝗲𝘀 , 𝗖𝗼𝗺𝗽𝗮ñ𝗲𝗿𝗼𝘀 , 𝗖𝗮𝗷𝗮𝘀 , 𝗔𝘂𝘁𝗼𝘀 , 𝗖𝗼𝗻𝘁𝗲𝗻𝗲𝗱𝗼𝗿𝗲𝘀 ( 𝗠𝗶𝗹𝗹 , 𝗢𝗯𝘀𝗲𝗿𝘃𝗮𝘁𝗼𝗿𝗶𝗼 )
➤𝟭 𝗣𝗰 ( 𝗠𝗮𝗻𝗱𝗮𝗿 𝗖𝗮𝗽 𝗔𝗻𝘁𝗲𝘀 𝗗𝗲 𝗜𝗻𝗶𝗰𝗶𝗮𝗿 )
➤𝗖𝗿𝗲𝗮𝗿 𝗖𝗼𝗻 𝗖𝗮𝘀𝗰𝗼 𝗬 𝗖𝗵𝗮𝗹𝗲𝗰𝗼 𝗔𝗹 𝟮 , 𝗛𝗼𝗻𝗴𝗼 𝗔𝗹 𝟯 , 𝗥𝗲𝗽𝗮𝗿𝗮𝗰𝗶𝗼𝗻 , 𝗚𝗹𝗼𝗼𝗱 , 𝗬 𝗟𝗮𝘀 𝗔𝗿𝗺𝗮𝘀 𝗠𝗲𝗻𝗰𝗶𝗼𝗻𝗮𝗱𝗮𝘀
➤𝗠𝟭𝟬𝟭𝟰 ( 𝟭 𝗫 𝗘𝗾𝘂𝗶𝗽𝗼 )
➤𝗤𝘂𝗲𝗱𝗮𝗿 𝗘𝗻 𝟳-𝟱 𝗣𝗮𝗿𝗮 𝟮𝗱𝗮
➤𝗤𝘂𝗲𝗱𝗮𝗿 𝗘𝗻 𝟳-𝟰 𝗢 𝗠𝗲𝗻𝗼𝘀 𝗘𝘀 𝗩𝘀 𝗚𝗮𝗻𝗮𝗱𝗼
➤𝟭𝟬 𝗠𝗶𝗻𝘂𝘁𝗼𝘀 𝗣𝗮𝗿𝗮 𝗧𝗼𝗱𝗼 , 𝟱 𝗣𝗮𝗿𝗮 𝗩𝗼𝗹𝘃𝗲𝗿 𝗔 𝗖𝗿𝗲𝗮𝗿
➤𝗡𝗼 𝗟𝗴𝘁𝗯
➤𝗟𝗶𝗯𝗿𝗲 𝗧𝗮𝗴 𝗦𝗶 𝗘𝘀 𝗧𝗲𝗮𝗺
➤𝗖𝗹𝗮𝗻 𝗧𝗼𝗱𝗼𝘀 𝗘𝗻 𝗘𝗹 𝗠𝗶𝘀𝗺𝗼
➤𝗠𝗮𝘀𝗰𝗼𝘁𝗮 𝗦𝗼𝗹𝗼 𝗣𝗶𝗻𝗴𝘂𝗶𝗻𝗼
➤𝟭 𝗘𝘀𝗽𝗲𝗰𝘁𝗮𝗱𝗼𝗿
`;
